//
// Created by hxl on 2019/4/17.
//
using namespace std;

/**
 *  数组是具有一定顺序关系的若干相同类型变量的集合，
 *  组成数组的变量称为该数组的元素。
 */
////数组初始化
////列出全部的元素的初始值
//int d[10] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
////列出部分元素的初始值
//int e[10] = {0, 1, 2, 3, 4};
////列出全部元素的初始值，可以不指定数组长度
//int f[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
//
////二维数组 内存中，按行存储
//float g[3][4];
////所有初始值写在一个{}内，按顺序初始化
//int h[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};
////分行列出二维数组元素的初值
//int i[3][4] = {{1,2,3,4},{5,6,7,8},{9,10,11,12}};
////只对部分元素初始化
//int j[3][4] = {{1},{0,1},{0,0,1,1,}};
////列出全部初始值，第一维下标可以缺省
//int k[][4] = {1,2,3,4,5,6,7,8,9,10,11,12};
//int l[][4] = {{1,2,3,4},{5,6,7,8},{9,10,11,12}};
class ArrayDemo {

public:
    ArrayDemo();

    ArrayDemo(int i);

    ~ArrayDemo();

/**
 * a 数组名字，是数组首元素的内存地址，
 *  数组名是一个常量，不能被赋值
 */
    int a[10];
    int b[10];
    int c[5][3];




    void printArray();

    //斐波那契数列
    void feibonaqie(int i);
};

